public/Discard_interface.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <header xmlns="xmlapi_1.0">
         <security>
            <user>C12285</user>
            <password hashed="false">Peru2018#</password>
         </security>
         <requestID>aquiroga:0001</requestID>
      </header>
   </SOAP:Header>

  <SOAP:Body>
    <find xmlns="xmlapi_1.0">
      <fullClassName>equipment.InterfaceStatsLogRecord</fullClassName>
         <filter>
          <and>
           <or>
            <between name="timeCaptured" first="1518138000000" second="1518139200000"/>
           </or>
           <or>
            <wildcard name="monitoredObjectSiteName" value="%CSR%"/>
           </or>
           <not>
            <or>
             <wildcard name="displayedName" value="Channel%"/>
             <wildcard name="displayedName" value="system%"/>
             <wildcard name="displayedName" value="loopback%"/>
            </or>
           </not>
          </and>
         </filter>
     <resultFilter>
        <attribute>monitoredObjectSiteName</attribute>
        <attribute>displayedName</attribute>
        <attribute>timeCaptured</attribute>
        <attribute>periodicTime </attribute>
        <attribute>receivedPacketsDiscarded</attribute>
        <attribute>outboundPacketsDiscarded</attribute>
        <attribute>receivedOctetsPeriodic</attribute>
        <attribute>transmittedOctetsPeriodic</attribute>
        <attribute>receivedPacketsDiscardedPeriodic</attribute>
        <attribute>outboundPacketsDiscardedPeriodic</attribute>
        <children/>
     </resultFilter>
    </find>
  </SOAP:Body>

</SOAP:Envelope>
